Feature: Визуализиране на налични игри

  Background: отваряне на приложението
    Given отваряне на приложението

  Scenario: Търсене на игра по име
    When потребителя въвежда име на игра "Game 1" в полето за търсене
    And натиска бутона за търсене
    Then Визуализира се игра с име "Game 1"

  Scenario: Филтриране на игри по жанр
    When потребителя избире жанр "Adventure"
    And натиска бутона за филтриране
    Then Визуализира се списък с игри в жанр "Adventure"

  Scenario: Преглед на детайлна информация за игра
    When потребителя избира игра с име "WOW"
    And натиска бутона за детайлна информация
    Then Визуализира се детайлна информация за играта "WOW"

  Scenario: Филтриране на игри по компания/създатели
    When потребителя избира разработчик "Develop 1"
    And натиска бутона за филтриране за разработчик
    Then Визуализира се списък с игри на разработчик "Developer 1"

  Scenario: Филтриране на игри по дата на издаване
    When потребителя избере дата на издаване "2023"
    And натиска бутона за филтриране по дата на издаване
    Then Визуализира се списък с игри, издадени през "2023"
